literate/Frame.org
#+TITLE: Stack Frame
#+PROPERTY: header-args    :comments both :tangle ../src/Frame.js

#+begin_src js
import { Category } from "concrete-parser";
#+end_src

#+begin_src js
export const Frame = (...args) => new _Frame(...args);

class _Frame {
    constructor (tree) {
        this.tree = tree;
        this.length = this.tree.tape.cells.length;
        this.head = 0;
        this.halted = false;
        this.arguments = [];
    }

    isBeyondEdge() { return this.head >= this.length; }

    advance() { this.head++; }

    halt() { this.halted = true; }

    getBlockAtHead() { return this.tree.tape.cells[this.head]; }

    isCommaAtHead() { return this.tree.tape.commas[this.head]; }

    placeResult(block) { this.tree.tape.cells[this.head + 1] = block; }

    clearArguments() { this.arguments = []; }
    
    appendBlockToArguments(block) { this.arguments.push(block); }
#+end_src

Arguments list can never include ValueIdentifiers, so always resolve them to their true value.

#+begin_src js
    appendBlockAtHeadValueToArguments() {
        let block = this.getBlockAtHead();

        while (block.is(Category.Value, "ValueIdentifier")) {
            block = this.tree.tape.getBlockAtLabel(block.identifier);
        }

        this.appendBlockToArguments(block);
    }
}
#+end_src
